------------------------------------------------------------------------
--	local m = P.reload(db.DataBaseMsgData)
--
------------------------------------------------------------------------
local Data = {}
------------------------------------------------------------------------
-- @brief 名字数组
Data.selectAllNames = {}
-- @brief 全局数据名字数组
Data.selectGlobalDataNames = {}
-- @brief 用户数组
Data.selectAllUser={}
------------------------------------------------------------------------
return Data
