/************************************************************************
* @File			:	DFTrigger.h
* @Author		:	Sword
* @DateTime		:	2016.7.9
* @Description	:
*
*
*
*
************************************************************************/
#ifndef __DFTriggerBase_H__
#define __DFTriggerBase_H__

#include "DFPrerequisite.h"

namespace DF{
	// -----------------------------------------------------------------------
	// @brief 触发器
	class DFExport Trigger
	{
	public:
		// -----------------------------------------------------------------------
		// @brief 构造函数
		Trigger(void){}
		// -----------------------------------------------------------------------
		// @brief 析构函数
		virtual ~Trigger(void){}
		// -----------------------------------------------------------------------
		// @brief 触发一个空参数
		virtual void triggering(void){}
		// -----------------------------------------------------------------------
		// @brief 触发一条消息
		// @param[pMsg] 消息
		virtual void triggering(MessageBase* pMsg){}
		// -----------------------------------------------------------------------
		// @brief 清空
		virtual void clear(void) = 0;
		// -----------------------------------------------------------------------
		// @brief 获取ID
		virtual unsigned int getID(void)const = 0;
		// -----------------------------------------------------------------------
		// @brief 获取类型
		virtual const char* getType(void) = 0;
		// -----------------------------------------------------------------------
		// @brief 移除一个触发器
		static void sremvoe(unsigned int uId);
		// -----------------------------------------------------------------------
		// @brief 查找一个触发器
		static Trigger* sfind(unsigned int uId);
	};
}
#endif
 